#include <stdio.h>
//筛选法求素数---->1先去掉不是素数，2是素数，然后把能被2整除（2的倍数）划掉；
//2之后是3也是素数，把3的倍数划掉，一直筛选至N，剩下的就都是素数 
int main()
{
	int i , j , k , N , b;
	int a[1001];  //固定数组大小 
	b=0;  //用来输出结果换行 
	printf("求出多少以内的素数：");
	scanf("%d",&N);  
	for(i=0;i<N;i++) a[i]=1;  //令所有元素都为1 
	k=2;  //筛选的起点为2 
	while(k<=N/2){   //筛选点不会大于N/2，剩下的都是素数 
		for(i=k+1;i<=N;i++){  
			if(a[i]==1&&i%k==0)  //先把能被2整除的标记为0； 
				a[i]=0;			
		}
		for(i=k+1;i<=N;i++){    //第一个3是素数，然后再把筛选点变成3，跳出重复上次循环 
			if(a[i]==1){
				k=i;
				break;
			}
		}
	}
	printf("%d以内的素数为:\n",N);
	for(i=2;i<=N;i++){
		if(a[i]==1){  
			b++;
			printf("%5d ",i);
			if(b%5==0) printf("\n"); 
		}
	}
	return 0;
}
