#include <stdio.h>

//二维数组就是数组中的数组，a[3][4]--->当做三个一维数组
//a[0]就相当于首行首地址，因为指向的数组，所以是个地址 
int main()
{
	int a[3][4]={1,3,5,7,9,11,13,15,17,19,21,23};
	printf("a=%d,*a=%d\n",a,*a);
	printf("a[0]=%d,*(a+0)=%d\n",a[0],*(a+0));
	printf("&a[0]=%d,&a[0][0]=%d\n",&a[0],&a[0][0]);
	printf("a[1]=%d,a+1=%d\n",a[1],a+1);
	printf("&a[1][0]=%d,*(a+1)+0=%d\n",&a[1][0],*(a+1)+0);
	printf("a[2]=%d,*(a+2)=%d\n",a[2],*(a+2));
	printf("&a[2]=%d,a+2=%d\n",&a[2],a+2);
	printf("a[1][0]=%d,*(*(a+1)+0)=%d\n",a[1][0],*(*(a+1)+0)); //1行0列元素的值 
	printf("*a[2]=%d,*(*(a+2)+0)=%d\n",*a[2],*(*(a+2)+0));     //2行0列元素的值 
	return 0;
}
